tutorials/lagrangian/reactingParcelFoam/verticalChannel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    inletCentral
    {
        type            fixedFluxPressure;
    }

    inletSides
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            prghPressure;
        p               uniform 100000;
    }

    walls
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
